import { Person2Outlined, ShowChartOutlined, Wifi, EventNoteOutlined } from "@mui/icons-material";

export const detailsText = [
  ` رستوران‌های زنجیره‌ای ترخینه در سال ۱۳۶۸ افتتاح گردیده‌اند و در طی
    این سال‌ها همواره با ارائه غذاهای باکیفیت و سرویس سریع و به موقع در
    تلاش برای جلب رضایت مشتریان خود بوده‌اند. در طی این سال‌ها اولویت
    جلب رضایت مشتریان بوده است.`,
  ` دراین خصوص ترخینه همیشه در تلاش بوده تا در طی این زمان‌ها کیفیت
    غذاهای خود را در بهترین حالت نگه داشته و حتی با نوسانات قیمت‌های
    مواد اولیه در بازار قیمت خود را ثابت نگه داشته است. ترخینه شعبات
    خودرا افتتاح کرده که بسیار شیک و مدرن می‌باشند و برای برگزاری
    جشن‌های کوچک و بزرگ شما مشتریان عزیز توانایی پذیرایی با کیفیت بالا
    را دارند. سالن پذیرایی شعبات در دو طبقه مجزا به همراه راه پله مدرن و
    آسانسور برای افراد کم‌توان و سالخورده آماده ارائه سرویس به شما
    عزیزان می‌باشند. چشم انداز: در آینده ای نزدیک تالار پذیرایی شعبات
    راه اندازی شده و آماده برگزاری جشن‌ها و مراسم‌های بزرگ شما خواهند
    بود. به امید آن روز که همه ایرانیان سالم و سلامت باشند.`,
];

type HighlightItem = {
  id: number;
  icon: typeof Person2Outlined;
  text: string;
};

export const highlightItems: HighlightItem[] = [
  {
    id: 1,
    icon: Person2Outlined,
    text: "پرسنلی مجرب و حرفه‌ای",
  },
  {
    id: 2,
    icon: ShowChartOutlined,
    text: "کیفیت بالای غذاها",
  },
  {
    id: 3,
    icon: Wifi,
    text: "محیطی دلنشین و آرام",
  },
  {
    id: 4,
    icon: EventNoteOutlined,
    text: "منوی متنوع",
  },
];
