export const branches = [
  {
    id: "ekbatan" as const,
    title: "آدرس شعبه اکباتان",
    address: "شهرک اکباتان، فاز ۳، مجتمع تجاری کوروش، طبقه سوم",
    phone1: "۱۲۵۴ ۵۴۸۹ -۰۲۱",
    phone2: "۱۲۵۵ ۵۴۸۹ -۰۲۱",
    hours: "همه‌روزه از ساعت ۱۲ تا ۲۳ بجز روزهای تعطیل",
  },
  {
    id: "vanak" as const,
    title: "آدرس شعبه ونک",
    address: "ونک ، فاز 1، مجتمع تجاری کوروش، طبقه سوم",
    phone1: "۱۲۵۴ ۵۴۸۹ -۰۲۱",
    phone2: "۱۲۵۵ ۵۴۸۹ -۰۲۱",
    hours: "همه‌روزه از ساعت ۱۲ تا ۲۳ بجز روزهای تعطیل",
  },
];
