import { categoryNavigationItemsProps } from "@/types/faq.types";

export const categoryNavigationItems: categoryNavigationItemsProps[] = [
  { id: "faq", label: "سوالات متداول" },
  { id: "rules", label: "قوانین ترخینه" },
  { id: "privacyPolicy", label: "حریم خصوصی" },
];

export type TabDetail = {
  id: string;
  category: string;
  title: string;
  information: string;
};

export const tabDetails: TabDetail[] = [
  {
    id: "1",
    category: "faq",
    title: "امکانات ترخینه",
    information:
      "وبسایت سفارش غذای رستوران‌های زنجیره‌ای ترخینه با اتصال مستقیم به نرم افزار اتوماسیون شعبات رستوران، امکان اشتباهات هنگام ثبت سفارش آنلاین غذا و همچنین زمان مورد نیاز برای آماده سازی و تحویل آن را به حداقل ممکن می رسونه.",
  },
  {
    id: "2",
    category: "faq",
    title: "حساب کاربری در ترخینه",
    information:
      "خیلی ساده، پس از انتخاب غذای مورد علاقه تان از منوی رستوران، هنگام ثبت سفارش با وارد کردن شماره تلفن همراه یک پیامک حاوی کد تایید برای شما ارسال و با وارد کردن کد تایید، ثبت نام شما تکمیل می شه. یا می تونید در صفحه اصلی سایت روی گزینه ورود کلیک کنید.",
  },
  {
    id: "3",
    category: "faq",
    title: "سابقه خرید",
    information: "با ورود به حساب کاربری و کلیک روی گزینه سفارشات قبلی سابقه تمام خریدهای شما نمایش داده می شه.",
  },
  {
    id: "4",
    category: "faq",
    title: "راه‌های پرداخت",
    information:
      "هنگام ثبت سفارش غذا می تونید روش پرداخت دلخواه خودتون رو انتخاب کنید. آنلاین و یا نقدی در هنگام تحویل سفارش بصورت حضوری.",
  },
  {
    id: "5",
    category: "faq",
    title: "تفاوت قیمت در منو شعبات و منو وبسایت",
    information:
      "بله. قیمت منوی وبسایت ترخینه دقیقا مطابق با قیمت منوی شعب رستوران  است و در صورت تغییر قیمت از طرف رستوران این تغییر در وبسایت ترخینه بلافاصله قابل مشاهده است.",
  },
  {
    id: "6",
    category: "faq",
    title: "هدیه و تخفیف",
    information:
      "برای استفاده از کد تخفیف میتونید به سادگی کد رو در سبد خرید، در قسمت مشخص شده وارد کنید. اعتبار هدیه هنگام انتخاب روش پرداخت برای شما نمایش داده میشه و در صورت تمایل میتونید ازش استفاده کنید.",
  },
  {
    id: "7",
    category: "rules",
    title: "حداقل سفارش",
    information:
      "حداقل سفارشات در رستوران‌های ترخینه، مبلغ ۵۰.۰۰۰ تومان است. برای ثبت، پردازش و ارسال سفارشات، باید حداقل، این مبلغ سفارش داده شود در غیر اینصورت سفارشات، ثبت نخواهد شد.",
  },
  {
    id: "8",
    category: "rules",
    title: "فاصله تحویل",
    information:
      "ترخینه در ارسال سفارشات به نقاط دور محدودیت دارد و حداکثر فاصله از رستوران‌های زنجیره‌ای ترخینه برای ارسال کالا، ۶ کیلومتر است. لطفا قبل از ثبت سفارش، نزدیک‌ترین شعبه به محل ارسال را انتخاب کنید و از رعایت کردن حداکثر فاصله برای ارسال سفارشات اطمینان حاصل فرمایید.",
  },
  {
    id: "9",
    category: "rules",
    title: "زمان تحویل",
    information:
      "جدول زمانی تخمینی تحویل در زمان ثبت سفارش به اطلاع شما خواهد رسید. این ممکن است تحت تأثیر عوامل زیادی مانند ترافیک، آب و هوا، دوره‌های شلوغ رستوران و غیره باشد، بنابراین در صورت تأخیر لطفا صبور باشید.",
  },
  {
    id: "10",
    category: "rules",
    title: "گزینه‌های پرداخت",
    information:
      "ما گزینه‌های پرداخت مختلفی را می پذیریم، از جمله پرداخت اینترنتی، کارت‌های اعتباری یا پول نقد. لطفاً قبل از تکمیل سفارش، روش پرداختی را که ترجیح می دهید، تأیید کنید.",
  },
  {
    id: "11",
    category: "rules",
    title: "دقت سفارش",
    information:
      "لطفاً قبل از ارسال، از دقیق بودن تمام جزئیات سفارش خود، از جمله موارد منو، دستورالعمل‌های خاص و  جزئیات سفارش خود اطمینان حاصل کنید تا اختلالی در فرایند پردازش و تحویل سفارشات شما ایجاد نشود و سفارشات شما در سریع‌ترین زمان ممکن به دست‌تان برسد.",
  },
  {
    id: "12",
    category: "rules",
    title: "شرایط لغو سفارش",
    information:
      "شما می‌توانید با تماس مستقیم با هر شعبه از رستوران‌های زنجیره‌ای ترخینه، سفارش خود را لغو کنید. لطفا توجه داشته باشید که ممکن است محدودیت زمانی برای لغو وجود داشته باشد، زیرا ممکن است غذا از قبل آماده شده باشد و در اینصورت متاسفانه امکان لغو سفارش وجود ندارد.",
  },
  {
    id: "13",
    category: "rules",
    title: "شرایط بازگشت سفارش",
    information:
      "اگر سفارش شما انتظارات شما را برآورده نمی کند، لطفاً بلافاصله از طریق تماس تلفنی با ما تماس بگیرید؛ ما در اسرع وقت به دنبال حل مشکل شما  خواهیم بود.",
  },
  {
    id: "14",
    category: "rules",
    title: "تخفیفات",
    information:
      "هر‌گونه تخفیف یا برنامه‌های وفاداری ممکن است قوانین و شرایط خاصی داشته باشد که به وضوح در وب سایت مشخص می‌شود.",
  },
  {
    id: "15",
    category: "privacyPolicy",
    title: "حریم خصوصی",
    information:
      "ترخینه متعهد می‌شود حریم خصوصی شما را حفظ کند و به آن احترام بگذارد. بخش «حریم خصوصی» روش‌های استفاده از اطلاعات شخصی کاربران در این وب سایت را شرح می‌دهد. اگر برای سفارش غذای خوب از خدمات ما استفاده می‌کنید، سیاست‌های حفظ حریم خصوصی وب‌سایت ترخینه، در مورد شما صدق می‌کند.",
  },
  {
    id: "16",
    category: "privacyPolicy",
    title: "چه اطلاعاتی را گردآوری می‌کنیم؟",
    information: "اطلاعاتی که درباره‌ی شما گردآوری و نگه‌داری می‌کنیم، ممکن است شامل موارد زیر باشد:",
  },
  {
    id: "17",
    category: "privacyPolicy",
    title: "چگونه اطلاعات شما را گردآوری می‌کنیم؟",
    information: "از شما تقاضا خواهیم کرد اطلاعات خود را در اختیار ما قرار دهید؛ هنگامی‌که:",
  },
  {
    id: "18",
    category: "privacyPolicy",
    title: "چرا به شماره تلفن شما نیاز داریم؟",
    information:
      "برای ثبت نام در وب‌سایت ترخینه باید نخست شماره موبایل خود را وارد کنید تا کد فعال‌سازی برای شما ارسال شود.",
  },
  {
    id: "19",
    category: "privacyPolicy",
    title: "فعالیت‌های مرورگر شما در هنگام بازدید از وب‌سایت ترخینه",
    information:
      "هنگامی‌که شما از وب‌سایت ترخینه استفاده می‌کنید، ما اطلاعاتی درباره‌ی فعالیت‌های شما گردآوری می‌کنیم که برخی از این اطلاعات عبارتند از:",
  },
  {
    id: "20",
    category: "privacyPolicy",
    title: "استفاده از کوکی‌ها و دستگاه‌های ذخیره‌سازی دیگر",
    information:
      "کوکی‌ها فایل‌های اطلاعاتی هستند که روی کامپیوتر شما ذخیره می‌شوند تا به وب‌سایت‌ها کمک کنند شما را به خاطر بیاورند. ما و همکاران‌مان، با استفاده از کوکی‌ها اطلاعاتی درباره شیوه‌ی استفاده شما از وب‌سایت‌مان گردآوری می‌کنیم؛ این اطلاعات ما را در بهبود رابط کاربری و محتوای سایت کمک خواهد کرد. شما نیز به وسیله‌ی ثبت و ذخیره‌سازی این کوکی‌ها، هنگام ورود مجدد به سایت، نیازی به ثبت مجدد نام کاربری و کلمه‌ی عبور نخواهید داشت. هم‌چنین ما به وسیله‌ی کوکی‌ها، آخرین وضعیت سفارش روز شما را ذخیره می‌کنیم تا شما بتوانید آن‌ها را در پروفایل خود مشاهده کنید.",
  },
  {
    id: "21",
    category: "privacyPolicy",
    title: "اطلاعات بیشتر",
    information:
      "در مجموعه‌ی ترخینه، حفظ امنیت اطلاعات شخصی شما را امری بسیار جدی و مهم می‌دانیم و در وب‌سایت خود از سیاست‌های امنیتی و فناوری‌هایی استفاده می‌کنیم که برای محافظت از اطلاعات شخصی طراحی شده‌اند؛ هم‌چنین از روش‌ها و دستورالعمل‌های امنیتی سختی که قوانین حفظ حریم خصوصی کاربران به آن‌ها نیاز دارد، پیروی می‌کنیم. این روش‌های محافظتی ذخیره‌سازی، استفاده و انتشار همه‌ی اطلاعات شما را دربر می‌گیرد و از دسترسی و استفاده‌ی غیرمجاز از این اطلاعات جلوگیری می‌کند.",
  },
];
